{
  "id": 12345,
  "title": "Song Exploder",
  "description": "Song Exploder is a podcast where musicians take apart their songs, and piece by piece, tell the story of how they were made. Each episode features an artist discussing a song of theirs, breaking down the sounds and ideas that went into the writing and recording. Hosted and produced by Hrishikesh Hirway.",
  "artworkUrl30": "https://is1-ssl.mzstatic.com/image/thumb/Podcasts126/v4/9c/d8/b0/9cd8b073-0f49-341b-3d3a-ab4da3b2aef2/mza_3440682107671500952.png/30x30bb.jpg",
  "artworkUrl60": "https://is1-ssl.mzstatic.com/image/thumb/Podcasts126/v4/9c/d8/b0/9cd8b073-0f49-341b-3d3a-ab4da3b2aef2/mza_3440682107671500952.png/60x60bb.jpg",
  "artworkUrl100": "https://is1-ssl.mzstatic.com/image/thumb/Podcasts126/v4/9c/d8/b0/9cd8b073-0f49-341b-3d3a-ab4da3b2aef2/mza_3440682107671500952.png/100x100bb.jpg",
  "artworkUrl600": "https://is1-ssl.mzstatic.com/image/thumb/Podcasts126/v4/9c/d8/b0/9cd8b073-0f49-341b-3d3a-ab4da3b2aef2/mza_3440682107671500952.png/600x600bb.jpg",
  "artistName": "Radiotopia",
  "episodes": [
    {
      "trackName": "Foo Fighters - The Teacher",
      "releaseDate": "2023-12-20T20:28:00Z",
      "trackTimeMillis": 2002,
      "trackId": 1000639258429,
      "trackDescription": "For the last episode of the year, I got the chance to drive up to Northridge, California, and have a conversation with Dave Grohl. We talked about the Foo Fighters song “The Teacher,” which is an epic, 10-minute-long song. Dave told me it’s the most important piece of music he’s ever written, because it’s dedicated to his mother, Virginia, who passed away in 2022. Dave Grohl started Foo Fighters in 1994, after Nirvana ended. This year, Foo Fighters set a record for having the most Top 10 hits on the Billboard Mainstream Rock charts. They’ve won 15 Grammy awards, including winning the Grammy for Best Rock album five times — more than anyone else. “The Teacher” is from their 11th album, But Here We Are, which came out in June 2023. I sat with Dave in the Foo Fighters practice space, and he told me the whole story of the song. Coming up, you’ll hear the two voice memos he originally recorded on acoustic guitar, plus the two demos he made on his way to figuring the song out.1",
      "trackUrl": "https://samplelib.com/lib/preview/mp3/sample-3s.mp3"
    },
    {
      "trackName": "Raye - Escapism (feat. 070 Shake)",
      "releaseDate": "2023-12-20T20:28:00Z",
      "trackTimeMillis": 3005,
      "trackId": 1000637710215,
      "trackDescription": "Raye is a singer, songwriter and producer from London. Besides being an artist in her own right, she’s also been a songwriter for other artists since she was a teenager. She’s co-written songs for Beyoncé, Charli XCX, and Ellie Goulding. In 2023, she released her debut album, My 21st Century Blues. The first single, “Escapism became her first song to hit #1 in the UK. It’s gone platinum in the US, the UK, and seven other countries. It features guest vocals from 070 Shake. When she was here in LA on tour, I talked to Raye about how she made “Escapism.”",
      "trackUrl": "https://samplelib.com/lib/preview/mp3/sample-3s.mp3"
    }
  ]
}
